Tekla Open API Reference for Tekla Structures 2025
ModificationStamp Constructor
Overload List
Name | Description
ModificationStamp()
 Creates a new modification stamp instance where the current modification stamp is 0. Can be used for fetching all the created or deleted model objects from the model history.
ModificationStamp(Int32, Int32)
 Creates a new modification stamp instance with the given local and server stamps. Can be used for fetching from the model history all the model objects that have been created or deleted after the specified stamp.
Top
See Also
Reference
ModificationStamp Class
Tekla.Structures.Model.History Namespace